In [1]:
%load_ext sql

%sql sqlite://

'Connected: @None'

In [2]:
import pandas as pd

import csv

In [3]:
with open('Students.csv','r') as f:
  students = pd.read_csv(f, index_col=0, encoding='utf-8')

%sql PERSIST students;

%sql SELECT * FROM students LIMIT 5;

 * sqlite://
 * sqlite://
Done.

[(1, 'Jacquie', 'Stansfield', 'jstansfield0@nhs.uk', 'Female', '78646 Commercial Point'),
 (2, 'Daisi', 'Fibbings', 'dfibbings1@chron.com', 'Male', '0752 Lakeland Street'),
 (3, 'Faunie', 'Hrihorovich', 'fhrihorovich2@telegraph.co.uk', 'Male', '02963 David Pass'),
 (4, 'Madelaine', 'Pearcey', 'mpearcey3@wikia.com', 'Male', '934 Hudson Alley'),
 (5, 'Loreen', 'Ragbourne', 'lragbourne4@abc.net.au', 'Male', '3 International Junction')]

In [4]:
# lets update daisi last name to wanjiku from  the students table

%%sql

UPDATE students

SET last_name = "Wanjiku"

WHERE first_name = "Daisi";

SELECT * FROM students LIMIT 5;

 * sqlite://
1 rows affected.
Done.

[(1, 'Jacquie', 'Stansfield', 'jstansfield0@nhs.uk', 'Female', '78646 Commercial Point'),
 (2, 'Daisi', 'Wanjiku', 'dfibbings1@chron.com', 'Male', '0752 Lakeland Street'),
 (3, 'Faunie', 'Hrihorovich', 'fhrihorovich2@telegraph.co.uk', 'Male', '02963 David Pass'),
 (4, 'Madelaine', 'Pearcey', 'mpearcey3@wikia.com', 'Male', '934 Hudson Alley'),
 (5, 'Loreen', 'Ragbourne', 'lragbourne4@abc.net.au', 'Male', '3 International Junction')]

In [11]:
# lets delete loreen ragbourne from our dataset

%%sql

DELETE FROM students WHERE id = 4;

SELECT * FROM students LIMIT 5;

 * sqlite://
0 rows affected.
Done.

[(1, 'Jacquie', 'Stansfield', 'jstansfield0@nhs.uk', 'Female', '78646 Commercial Point'),
 (2, 'Daisi', 'Wanjiku', 'dfibbings1@chron.com', 'Male', '0752 Lakeland Street'),
 (3, 'Faunie', 'Hrihorovich', 'fhrihorovich2@telegraph.co.uk', 'Male', '02963 David Pass'),
 (5, 'Loreen', 'Ragbourne', 'lragbourne4@abc.net.au', 'Male', '3 International Junction'),
 (6, 'Arlena', 'Marvel', 'amarvel5@angelfire.com', 'Male', '33 Lillian Court')]